app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hey"], ["text", "This is my very first article!"], ["created_at", "2015-03-15 06:12:00.957996"], ["updated_at", "2015-03-15 06:12:00.957996"]]
---
  def create
    # render plain: params[:article].inspect
    @article = Article.new(article_params)

    @article.save